
#ifndef __RK6748_LCD_H__
#define __RK6748_LCD_H__

#include "types.h"

#define LCD_SIZE_X       640
#define LCD_SIZE_Y       480

#define LCD_PIXElWIDE        ( 16)
#define LCD_LINE_SIZE        (LCD_SIZE_X << 1)
#define PALETTE_SIZE         32
#define DISPLAYMEMORYSIZE    ((LCD_SIZE_X<<1)*LCD_SIZE_Y)


typedef struct
{
   UINT32 REVID;               // 0x0000
   UINT32 LCD_CTRL;            // 0x0004
   UINT32 LCD_STAT;            // 0x0008
   UINT32 LIDD_CTRL;           // 0x000C
   UINT32 LIDD_CS0_CONF;       // 0x0010
   UINT32 LIDD_CS0_ADDR;       // 0x0014
   UINT32 LIDD_CS0_DATA;       // 0x0018
   UINT32 LIDD_CS1_CONF;       // 0x001C
   UINT32 LIDD_CS1_ADDR;       // 0x0020
   UINT32 LIDD_CS1_DATA;       // 0x0024
   UINT32 RASTER_CTRL;         // 0x0028
   UINT32 RASTER_TIMING_0;     // 0x002C
   UINT32 RASTER_TIMING_1;     // 0x0030
   UINT32 RASTER_TIMING_2;     // 0x0034
   UINT32 RASTER_SUBPANEL;     // 0x0038
   UINT32 RSVD0;               // 0x003C
   UINT32 LCDDMA_CTRL;         // 0x0040
   UINT32 LCDDMA_FB0_BASE;     // 0x0044
   UINT32 LCDDMA_FB0_CEILING;  // 0x0048
   UINT32 LCDDMA_FB1_BASE;     // 0x004C
   UINT32 LCDDMA_FB1_CEILING;  // 0x0050
} tagLcdcReg;

tagLcdcReg volatile * const g_ptLcdcReg = (tagLcdcReg *)0x01E13000;


typedef struct 
{
   UINT32 REVID;            // 0x0000
   UINT32 RSVD0;            // 0x0004
   UINT32 DIEIDR[4];        // 0x0008
//   UINT32 DEVIDR0;
   UINT32 RSVD1[1];         // 0x001c
   UINT32 BOOTCFG;          // 0x0020
   UINT32 RSVD2[5];         // 0x0024
   UINT32 KICKR[2];         // 0x0038
   UINT32 HOST0CFG;         // 0x0040
   UINT32 HOST1CFG;         // 0x0044
   UINT32 RSVD3[38];        // 0x0048
   UINT32 IRAWSTAT;         // 0x00E0
   UINT32 IENSTAT;          // 0x00E4
   UINT32 IENSET;           // 0x00E8
   UINT32 IENCLR;           // 0x00EC
   UINT32 EOI;              // 0x00F0
   UINT32 FLTADDRR;         // 0x00F4
   UINT32 FLTSTAT;          // 0x00F8
   UINT32 RSVD4[5];         // 0x00FC
   UINT32 MSTPRI[3];        // 0x0110
   UINT32 RSVD5;            // 0x011C
   UINT32 PINMUX[20];       // 0x0120
   UINT32 SUSPSRC;          // 0x0170
   UINT32 CHIPSIG;          // 0x0174
   UINT32 CHIPSIG_CLR;      // 0x0178
   UINT32 CFGCHIP[5];       // 0x017C
}tagSysconfig0Reg;

tagSysconfig0Reg volatile * const g_ptSysconfig0Reg= (tagSysconfig0Reg *)0x01c14000;
/*
const unsigned char gImage_xp640480[614400] = { 
0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,
0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X22,0X90,0X1A,0X90,0X1A,
0X91,0X1A,0X91,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,
0X90,0X1A,0X90,0X1A,0X90,0X22,0X90,0X22,0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,
0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,
0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X22,0X90,0X1A,0X90,0X1A,
0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,
0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,
0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,0X90,0X1A,0X70,0X22,0X70,0X22,
